//==================================================
//
// ゲームモード
// Author : Yuda Kaito
//
//==================================================

//==================================================
// インクルード
//==================================================
// 主要系統
#include "main.h"
#include "title.h"
#include "fade.h"
#include "input.h"
#include "sound.h"
// 描画系統
#include "rectangle.h"
#include "fan.h"
#include "color.h"
// 処理系統
#include "time.h"
#include "utility.h"
#include "block.h"
#include "map.h"
#include "player.h"
#include "bullet.h"
// オブジェクト系統
#include "object.h"
#include "object2d.h"

#include <assert.h>

//--------------------------------------------------
// コンストラクタ
//--------------------------------------------------
CTitle::CTitle()
{

}

//--------------------------------------------------
// デストラクタ
//--------------------------------------------------
CTitle::~CTitle()
{

}

//--------------------------------------------------
// 初期化
//--------------------------------------------------
HRESULT  CTitle::Init()
{
	return S_OK;
}

//--------------------------------------------------
// 終了
//--------------------------------------------------
void CTitle::Uninit()
{

}

//--------------------------------------------------
// 更新
//--------------------------------------------------
void CTitle::Update()
{

}

//--------------------------------------------------
// 描画
//--------------------------------------------------
void CTitle::Draw()
{
	// 背景の描画
	//if (object != nullptr)
	//{
	//	object->Draw();
	//}

	//DrawMap();

	// プレイヤ―の描画
	//player[0]->Draw();
	//player[1]->Draw();
}
