//**************************************************
//
// Hackathon ( tutorial.cpp )
// Author  : katsuki mizuki
//
//**************************************************

//==================================================
// インクルード
//==================================================
#include "main.h"
#include "tutorial.h"
#include "rectangle.h"
#include "texture.h"
#include "input.h"
#include "mode.h"
#include "game.h"
#include "sound.h"

//==================================================
// 定義
//==================================================
namespace
{
const int	MAX_TIME = 900;	// タイムの最大値
}// namespaceはここまで

//==================================================
// 静的変数
//==================================================
namespace
{
int s_nIdx;
}// namespaceはここまで

 //==================================================
 // スタティック関数プロトタイプ宣言
 //==================================================
namespace
{
void Input(void);
}// namespaceはここまで

 //--------------------------------------------------
 // 初期化
 //--------------------------------------------------
void InitTutorial(void)
{
	{// ロゴ
	 // 矩形の設定
		s_nIdx = SetRectangle(TEXTURE_BG);

		D3DXVECTOR3 size = D3DXVECTOR3(200.0f, 200.0f, 0.0f);
		D3DXVECTOR3 pos = D3DXVECTOR3(SCREEN_WIDTH * 0.275f, SCREEN_HEIGHT * 0.5f, 0.0f);

		// 矩形の位置の設定
		SetPosRectangle(s_nIdx, pos, size);
	}
}

//--------------------------------------------------
// 終了
//--------------------------------------------------
void UninitTutorial(void)
{

}

//--------------------------------------------------
// 更新
//--------------------------------------------------
void UpdateTutorial(void)
{
	Input();
}

//--------------------------------------------------
// 描画
//--------------------------------------------------
void DrawTutorial(void)
{
	// 矩形の描画
	DrawRectangle();
}


namespace
{
//--------------------------------------------------
// 入力
//--------------------------------------------------
void Input(void)
{
	if (GetFunctionKeyTrigger(FUNCTION_KEY_DESISION))
	{//決定キー(ENTERキー)が押されたかどうか
		ChangeMode(MODE_GAME);
	}
}
}// namespaceはここまで
